import json

def main():
    # В коді програми задається словник (кількість записів - 10)
    data = {
        "Ілларіонов": ["Микита", "Іванович", 2005],
        "Шевченко": ["Тарас", "Григорович", 1814],
        "Франко": ["Іван", "Якович", 1856],
        "Українка": ["Леся", "Петрівна", 1871],
        "Сковорода": ["Григорій", "Савич", 1722],
        "Грушевський": ["Михайло", "Сергійович", 1866],
        "Хмельницький": ["Богдан", "Михайлович", 1595],
        "Костенко": ["Ліна", "Василівна", 1930],
        "Симоненко": ["Василь", "Андрійович", 1935],
        "Чорновіл": ["В'ячеслав", "Максимович", 1937]
    }

    # Програма повинна записати створений словник в json файл (кодування: UTF-8, літери а не коди)
    with open("data.json", "w", encoding="utf-8") as file:
        json.dump(data, file, ensure_ascii=False, indent=4)
        
    # Програма повинна прочитати json файл і вивести в консоль всі записи
    with open("data.json", "r", encoding="utf-8") as file:
        loaded_data = json.load(file)
        
    print("--- Прочитані записи з JSON файлу ---")
    for surname, info in loaded_data.items():
        print(f"Прізвище: {surname}, Ім'я: {info[0]}, По батькові: {info[1]}, Рік народження: {info[2]}")

if __name__ == "__main__":
    main()